simple-socket-load-test.yaml
config:
  target: 'https://geo-jumper-backend.herokuapp.com'
  # target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 30
    # - duration: 60
    #   arrivalRate: 30
scenarios:
  - engine: "socketio"
    flow:
      - loop:
          - emit:
              channel: "join-room"
          - emit:
              channel: "render-players"
              data: { "direction": "left", "characterStatus": [10, 10, 10, 10, 10, 10, 10, 10, 10, 10]}
        count: 2